; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-25-23)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 room24 room25 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 - object)
(:init
(at-robby robot1 room2)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room16)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room5)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room8)
(at ball2 room15)
(at ball3 room17)
(at ball4 room21)
(at ball5 room9)
(at ball6 room18)
(at ball7 room15)
(at ball8 room7)
(at ball9 room14)
(at ball10 room17)
(at ball11 room13)
(at ball12 room20)
(at ball13 room10)
(at ball14 room15)
(at ball15 room25)
(at ball16 room5)
(at ball17 room23)
(at ball18 room16)
(at ball19 room3)
(at ball20 room23)
(at ball21 room1)
(at ball22 room23)
(at ball23 room3)
)
(:goal
(and
(at ball1 room21)
(at ball2 room13)
(at ball3 room10)
(at ball4 room6)
(at ball5 room3)
(at ball6 room12)
(at ball7 room22)
(at ball8 room8)
(at ball9 room19)
(at ball10 room11)
(at ball11 room25)
(at ball12 room15)
(at ball13 room19)
(at ball14 room17)
(at ball15 room4)
(at ball16 room1)
(at ball17 room5)
(at ball18 room20)
(at ball19 room13)
(at ball20 room25)
(at ball21 room5)
(at ball22 room3)
(at ball23 room24)
)
)
)

; plan
1. (pick robot3 ball16 room5 lgripper3)
   deleted: (at ball16 room5) (free robot3 lgripper3)
   added: (carry robot3 ball16 lgripper3)
   goals met: 0 of 23
2. (pick robot2 ball18 room16 lgripper2)
   deleted: (at ball18 room16) (free robot2 lgripper2)
   added: (carry robot2 ball18 lgripper2)
   goals met: 0 of 23
3. (move robot1 room2 room9)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room9)
   goals met: 0 of 23
4. (move robot2 room16 room9)
   deleted: (at-robby robot2 room16)
   added: (at-robby robot2 room9)
   goals met: 0 of 23
5. (move robot3 room5 room18)
   deleted: (at-robby robot3 room5)
   added: (at-robby robot3 room18)
   goals met: 0 of 23
6. (pick robot1 ball5 room9 lgripper1)
   deleted: (at ball5 room9) (free robot1 lgripper1)
   added: (carry robot1 ball5 lgripper1)
   goals met: 0 of 23
7. (move robot2 room9 room20)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room20)
   goals met: 0 of 23
8. (pick robot3 ball6 room18 rgripper3)
   deleted: (at ball6 room18) (free robot3 rgripper3)
   added: (carry robot3 ball6 rgripper3)
   goals met: 0 of 23
9. (move robot1 room9 room20)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room20)
   goals met: 0 of 23
10. (drop robot2 ball18 room20 lgripper2)
   deleted: (carry robot2 ball18 lgripper2)
   added: (at ball18 room20) (free robot2 lgripper2)
   goals met: 1 of 23
11. (move robot3 room18 room12)
   deleted: (at-robby robot3 room18)
   added: (at-robby robot3 room12)
   goals met: 1 of 23
12. (move robot1 room20 room3)
   deleted: (at-robby robot1 room20)
   added: (at-robby robot1 room3)
   goals met: 1 of 23
13. (pick robot2 ball12 room20 rgripper2)
   deleted: (at ball12 room20) (free robot2 rgripper2)
   added: (carry robot2 ball12 rgripper2)
   goals met: 1 of 23
14. (drop robot3 ball6 room12 rgripper3)
   deleted: (carry robot3 ball6 rgripper3)
   added: (at ball6 room12) (free robot3 rgripper3)
   goals met: 2 of 23
15. (pick robot1 ball23 room3 rgripper1)
   deleted: (at ball23 room3) (free robot1 rgripper1)
   added: (carry robot1 ball23 rgripper1)
   goals met: 2 of 23
16. (drop robot1 ball5 room3 lgripper1)
   deleted: (carry robot1 ball5 lgripper1)
   added: (at ball5 room3) (free robot1 lgripper1)
   goals met: 3 of 23
17. (move robot2 room20 room8)
   deleted: (at-robby robot2 room20)
   added: (at-robby robot2 room8)
   goals met: 3 of 23
18. (move robot3 room12 room1)
   deleted: (at-robby robot3 room12)
   added: (at-robby robot3 room1)
   goals met: 3 of 23
19. (move robot1 room3 room24)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room24)
   goals met: 3 of 23
20. (move robot2 room8 room15)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room15)
   goals met: 3 of 23
21. (drop robot3 ball16 room1 lgripper3)
   deleted: (carry robot3 ball16 lgripper3)
   added: (at ball16 room1) (free robot3 lgripper3)
   goals met: 4 of 23
22. (drop robot1 ball23 room24 rgripper1)
   deleted: (carry robot1 ball23 rgripper1)
   added: (at ball23 room24) (free robot1 rgripper1)
   goals met: 5 of 23
23. (pick robot3 ball21 room1 rgripper3)
   deleted: (at ball21 room1) (free robot3 rgripper3)
   added: (carry robot3 ball21 rgripper3)
   goals met: 5 of 23
24. (drop robot2 ball12 room15 rgripper2)
   deleted: (carry robot2 ball12 rgripper2)
   added: (at ball12 room15) (free robot2 rgripper2)
   goals met: 6 of 23
25. (pick robot2 ball7 room15 lgripper2)
   deleted: (at ball7 room15) (free robot2 lgripper2)
   added: (carry robot2 ball7 lgripper2)
   goals met: 6 of 23
26. (move robot3 room1 room5)
   deleted: (at-robby robot3 room1)
   added: (at-robby robot3 room5)
   goals met: 6 of 23
27. (move robot2 room15 room22)
   deleted: (at-robby robot2 room15)
   added: (at-robby robot2 room22)
   goals met: 6 of 23
28. (move robot1 room24 room7)
   deleted: (at-robby robot1 room24)
   added: (at-robby robot1 room7)
   goals met: 6 of 23
29. (drop robot3 ball21 room5 rgripper3)
   deleted: (carry robot3 ball21 rgripper3)
   added: (at ball21 room5) (free robot3 rgripper3)
   goals met: 7 of 23
30. (drop robot2 ball7 room22 lgripper2)
   deleted: (carry robot2 ball7 lgripper2)
   added: (at ball7 room22) (free robot2 lgripper2)
   goals met: 8 of 23
31. (pick robot1 ball8 room7 lgripper1)
   deleted: (at ball8 room7) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 8 of 23
32. (move robot1 room7 room8)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room8)
   goals met: 8 of 23
33. (move robot3 room5 room21)
   deleted: (at-robby robot3 room5)
   added: (at-robby robot3 room21)
   goals met: 8 of 23
34. (move robot2 room22 room19)
   deleted: (at-robby robot2 room22)
   added: (at-robby robot2 room19)
   goals met: 8 of 23
35. (move robot2 room19 room3)
   deleted: (at-robby robot2 room19)
   added: (at-robby robot2 room3)
   goals met: 8 of 23
36. (drop robot1 ball8 room8 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room8) (free robot1 lgripper1)
   goals met: 9 of 23
37. (pick robot1 ball1 room8 rgripper1)
   deleted: (at ball1 room8) (free robot1 rgripper1)
   added: (carry robot1 ball1 rgripper1)
   goals met: 9 of 23
38. (pick robot3 ball4 room21 lgripper3)
   deleted: (at ball4 room21) (free robot3 lgripper3)
   added: (carry robot3 ball4 lgripper3)
   goals met: 9 of 23
39. (move robot3 room21 room6)
   deleted: (at-robby robot3 room21)
   added: (at-robby robot3 room6)
   goals met: 9 of 23
40. (move robot1 room8 room21)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room21)
   goals met: 9 of 23
41. (pick robot2 ball19 room3 lgripper2)
   deleted: (at ball19 room3) (free robot2 lgripper2)
   added: (carry robot2 ball19 lgripper2)
   goals met: 9 of 23
42. (drop robot3 ball4 room6 lgripper3)
   deleted: (carry robot3 ball4 lgripper3)
   added: (at ball4 room6) (free robot3 lgripper3)
   goals met: 10 of 23
43. (drop robot1 ball1 room21 rgripper1)
   deleted: (carry robot1 ball1 rgripper1)
   added: (at ball1 room21) (free robot1 rgripper1)
   goals met: 11 of 23
44. (move robot2 room3 room5)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room5)
   goals met: 11 of 23
45. (move robot1 room21 room5)
   deleted: (at-robby robot1 room21)
   added: (at-robby robot1 room5)
   goals met: 11 of 23
46. (move robot3 room6 room25)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room25)
   goals met: 11 of 23
47. (move robot2 room5 room13)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room13)
   goals met: 11 of 23
48. (move robot1 room5 room23)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room23)
   goals met: 11 of 23
49. (pick robot3 ball15 room25 lgripper3)
   deleted: (at ball15 room25) (free robot3 lgripper3)
   added: (carry robot3 ball15 lgripper3)
   goals met: 11 of 23
50. (drop robot2 ball19 room13 lgripper2)
   deleted: (carry robot2 ball19 lgripper2)
   added: (at ball19 room13) (free robot2 lgripper2)
   goals met: 12 of 23
51. (pick robot2 ball11 room13 rgripper2)
   deleted: (at ball11 room13) (free robot2 rgripper2)
   added: (carry robot2 ball11 rgripper2)
   goals met: 12 of 23
52. (move robot3 room25 room4)
   deleted: (at-robby robot3 room25)
   added: (at-robby robot3 room4)
   goals met: 12 of 23
53. (move robot2 room13 room25)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room25)
   goals met: 12 of 23
54. (pick robot1 ball22 room23 lgripper1)
   deleted: (at ball22 room23) (free robot1 lgripper1)
   added: (carry robot1 ball22 lgripper1)
   goals met: 12 of 23
55. (pick robot1 ball17 room23 rgripper1)
   deleted: (at ball17 room23) (free robot1 rgripper1)
   added: (carry robot1 ball17 rgripper1)
   goals met: 12 of 23
56. (drop robot3 ball15 room4 lgripper3)
   deleted: (carry robot3 ball15 lgripper3)
   added: (at ball15 room4) (free robot3 lgripper3)
   goals met: 13 of 23
57. (drop robot2 ball11 room25 rgripper2)
   deleted: (carry robot2 ball11 rgripper2)
   added: (at ball11 room25) (free robot2 rgripper2)
   goals met: 14 of 23
58. (move robot1 room23 room5)
   deleted: (at-robby robot1 room23)
   added: (at-robby robot1 room5)
   goals met: 14 of 23
59. (drop robot1 ball17 room5 rgripper1)
   deleted: (carry robot1 ball17 rgripper1)
   added: (at ball17 room5) (free robot1 rgripper1)
   goals met: 15 of 23
60. (move robot2 room25 room23)
   deleted: (at-robby robot2 room25)
   added: (at-robby robot2 room23)
   goals met: 15 of 23
61. (move robot3 room4 room19)
   deleted: (at-robby robot3 room4)
   added: (at-robby robot3 room19)
   goals met: 15 of 23
62. (move robot1 room5 room3)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room3)
   goals met: 15 of 23
63. (pick robot2 ball20 room23 lgripper2)
   deleted: (at ball20 room23) (free robot2 lgripper2)
   added: (carry robot2 ball20 lgripper2)
   goals met: 15 of 23
64. (move robot3 room19 room17)
   deleted: (at-robby robot3 room19)
   added: (at-robby robot3 room17)
   goals met: 15 of 23
65. (drop robot1 ball22 room3 lgripper1)
   deleted: (carry robot1 ball22 lgripper1)
   added: (at ball22 room3) (free robot1 lgripper1)
   goals met: 16 of 23
66. (move robot2 room23 room25)
   deleted: (at-robby robot2 room23)
   added: (at-robby robot2 room25)
   goals met: 16 of 23
67. (pick robot3 ball3 room17 lgripper3)
   deleted: (at ball3 room17) (free robot3 lgripper3)
   added: (carry robot3 ball3 lgripper3)
   goals met: 16 of 23
68. (pick robot3 ball10 room17 rgripper3)
   deleted: (at ball10 room17) (free robot3 rgripper3)
   added: (carry robot3 ball10 rgripper3)
   goals met: 16 of 23
69. (drop robot2 ball20 room25 lgripper2)
   deleted: (carry robot2 ball20 lgripper2)
   added: (at ball20 room25) (free robot2 lgripper2)
   goals met: 17 of 23
70. (move robot1 room3 room15)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room15)
   goals met: 17 of 23
71. (move robot3 room17 room11)
   deleted: (at-robby robot3 room17)
   added: (at-robby robot3 room11)
   goals met: 17 of 23
72. (drop robot3 ball10 room11 rgripper3)
   deleted: (carry robot3 ball10 rgripper3)
   added: (at ball10 room11) (free robot3 rgripper3)
   goals met: 18 of 23
73. (move robot2 room25 room19)
   deleted: (at-robby robot2 room25)
   added: (at-robby robot2 room19)
   goals met: 18 of 23
74. (pick robot1 ball2 room15 lgripper1)
   deleted: (at ball2 room15) (free robot1 lgripper1)
   added: (carry robot1 ball2 lgripper1)
   goals met: 18 of 23
75. (pick robot1 ball14 room15 rgripper1)
   deleted: (at ball14 room15) (free robot1 rgripper1)
   added: (carry robot1 ball14 rgripper1)
   goals met: 18 of 23
76. (move robot3 room11 room10)
   deleted: (at-robby robot3 room11)
   added: (at-robby robot3 room10)
   goals met: 18 of 23
77. (move robot1 room15 room17)
   deleted: (at-robby robot1 room15)
   added: (at-robby robot1 room17)
   goals met: 18 of 23
78. (move robot2 room19 room14)
   deleted: (at-robby robot2 room19)
   added: (at-robby robot2 room14)
   goals met: 18 of 23
79. (drop robot1 ball14 room17 rgripper1)
   deleted: (carry robot1 ball14 rgripper1)
   added: (at ball14 room17) (free robot1 rgripper1)
   goals met: 19 of 23
80. (drop robot3 ball3 room10 lgripper3)
   deleted: (carry robot3 ball3 lgripper3)
   added: (at ball3 room10) (free robot3 lgripper3)
   goals met: 20 of 23
81. (pick robot3 ball13 room10 rgripper3)
   deleted: (at ball13 room10) (free robot3 rgripper3)
   added: (carry robot3 ball13 rgripper3)
   goals met: 20 of 23
82. (pick robot2 ball9 room14 lgripper2)
   deleted: (at ball9 room14) (free robot2 lgripper2)
   added: (carry robot2 ball9 lgripper2)
   goals met: 20 of 23
83. (move robot3 room10 room19)
   deleted: (at-robby robot3 room10)
   added: (at-robby robot3 room19)
   goals met: 20 of 23
84. (move robot1 room17 room13)
   deleted: (at-robby robot1 room17)
   added: (at-robby robot1 room13)
   goals met: 20 of 23
85. (move robot2 room14 room19)
   deleted: (at-robby robot2 room14)
   added: (at-robby robot2 room19)
   goals met: 20 of 23
86. (drop robot3 ball13 room19 rgripper3)
   deleted: (carry robot3 ball13 rgripper3)
   added: (at ball13 room19) (free robot3 rgripper3)
   goals met: 21 of 23
87. (drop robot1 ball2 room13 lgripper1)
   deleted: (carry robot1 ball2 lgripper1)
   added: (at ball2 room13) (free robot1 lgripper1)
   goals met: 22 of 23
88. (drop robot2 ball9 room19 lgripper2)
   deleted: (carry robot2 ball9 lgripper2)
   added: (at ball9 room19) (free robot2 lgripper2)
   goals met: 23 of 23
